tools/k6/resultats/avant-2026-09-24/palier-25.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /Users/macbookpro/klassio-saas/tools/k6/charge.js
        output: -

     scenarios: (100.00%) 1 scenario, 25 max VUs, 1m27s max duration (incl. graceful stop):
              * matinee: Up to 25 looping VUs for 1m7s over 3 stages (gracefulRampDown: 20s, gracefulStop: 30s)


running (0m01.0s), 01/25 VUs, 0 complete and 0 interrupted iterations
matinee   [   0% ] 01/25 VUs  0m00.3s/1m07.0s

running (0m02.0s), 03/25 VUs, 0 complete and 0 interrupted iterations
matinee   [   2% ] 03/25 VUs  0m01.3s/1m07.0s

running (0m03.0s), 06/25 VUs, 0 complete and 0 interrupted iterations
matinee   [   3% ] 06/25 VUs  0m02.3s/1m07.0s

running (0m04.0s), 08/25 VUs, 0 complete and 0 interrupted iterations
matinee   [   5% ] 08/25 VUs  0m03.3s/1m07.0s

running (0m05.0s), 10/25 VUs, 0 complete and 0 interrupted iterations
matinee   [   6% ] 10/25 VUs  0m04.3s/1m07.0s

running (0m06.0s), 12/25 VUs, 1 complete and 0 interrupted iterations
matinee   [   8% ] 12/25 VUs  0m05.3s/1m07.0s

running (0m07.0s), 14/25 VUs, 1 complete and 0 interrupted iterations
matinee   [   9% ] 14/25 VUs  0m06.3s/1m07.0s

running (0m08.0s), 16/25 VUs, 4 complete and 0 interrupted iterations
matinee   [  11% ] 16/25 VUs  0m07.3s/1m07.0s

running (0m09.0s), 19/25 VUs, 6 complete and 0 interrupted iterations
matinee   [  12% ] 19/25 VUs  0m08.3s/1m07.0s

running (0m10.0s), 21/25 VUs, 9 complete and 0 interrupted iterations
matinee   [  14% ] 21/25 VUs  0m09.3s/1m07.0s

running (0m11.0s), 23/25 VUs, 10 complete and 0 interrupted iterations
matinee   [  15% ] 23/25 VUs  0m10.3s/1m07.0s

running (0m12.0s), 25/25 VUs, 13 complete and 0 interrupted iterations
matinee   [  17% ] 25/25 VUs  0m11.3s/1m07.0s

running (0m13.0s), 25/25 VUs, 16 complete and 0 interrupted iterations
matinee   [  18% ] 25/25 VUs  0m12.3s/1m07.0s

running (0m14.0s), 25/25 VUs, 19 complete and 0 interrupted iterations
matinee   [  20% ] 25/25 VUs  0m13.3s/1m07.0s

running (0m15.0s), 25/25 VUs, 24 complete and 0 interrupted iterations
matinee   [  21% ] 25/25 VUs  0m14.3s/1m07.0s

running (0m16.0s), 25/25 VUs, 27 complete and 0 interrupted iterations
matinee   [  23% ] 25/25 VUs  0m15.3s/1m07.0s

running (0m17.0s), 25/25 VUs, 33 complete and 0 interrupted iterations
matinee   [  24% ] 25/25 VUs  0m16.3s/1m07.0s

running (0m18.0s), 25/25 VUs, 34 complete and 0 interrupted iterations
matinee   [  26% ] 25/25 VUs  0m17.3s/1m07.0s

running (0m19.0s), 25/25 VUs, 38 complete and 0 interrupted iterations
matinee   [  27% ] 25/25 VUs  0m18.3s/1m07.0s

running (0m20.0s), 25/25 VUs, 43 complete and 0 interrupted iterations
matinee   [  29% ] 25/25 VUs  0m19.3s/1m07.0s

running (0m21.0s), 25/25 VUs, 48 complete and 0 interrupted iterations
matinee   [  30% ] 25/25 VUs  0m20.3s/1m07.0s

running (0m22.0s), 25/25 VUs, 53 complete and 0 interrupted iterations
matinee   [  32% ] 25/25 VUs  0m21.3s/1m07.0s

running (0m23.0s), 25/25 VUs, 57 complete and 0 interrupted iterations
matinee   [  33% ] 25/25 VUs  0m22.3s/1m07.0s

running (0m24.0s), 25/25 VUs, 59 complete and 0 interrupted iterations
matinee   [  35% ] 25/25 VUs  0m23.3s/1m07.0s

running (0m25.0s), 25/25 VUs, 64 complete and 0 interrupted iterations
matinee   [  36% ] 25/25 VUs  0m24.3s/1m07.0s

running (0m26.0s), 25/25 VUs, 66 complete and 0 interrupted iterations
matinee   [  38% ] 25/25 VUs  0m25.3s/1m07.0s

running (0m27.0s), 25/25 VUs, 74 complete and 0 interrupted iterations
matinee   [  39% ] 25/25 VUs  0m26.3s/1m07.0s

running (0m28.0s), 25/25 VUs, 74 complete and 0 interrupted iterations
matinee   [  41% ] 25/25 VUs  0m27.3s/1m07.0s

running (0m29.0s), 25/25 VUs, 80 complete and 0 interrupted iterations
matinee   [  42% ] 25/25 VUs  0m28.3s/1m07.0s

running (0m30.0s), 25/25 VUs, 87 complete and 0 interrupted iterations
matinee   [  44% ] 25/25 VUs  0m29.3s/1m07.0s

running (0m31.0s), 25/25 VUs, 89 complete and 0 interrupted iterations
matinee   [  45% ] 25/25 VUs  0m30.3s/1m07.0s

running (0m32.0s), 25/25 VUs, 91 complete and 0 interrupted iterations
matinee   [  47% ] 25/25 VUs  0m31.3s/1m07.0s

running (0m33.0s), 25/25 VUs, 95 complete and 0 interrupted iterations
matinee   [  48% ] 25/25 VUs  0m32.3s/1m07.0s

running (0m34.0s), 25/25 VUs, 99 complete and 0 interrupted iterations
matinee   [  50% ] 25/25 VUs  0m33.3s/1m07.0s

running (0m35.0s), 25/25 VUs, 103 complete and 0 interrupted iterations
matinee   [  51% ] 25/25 VUs  0m34.3s/1m07.0s

running (0m36.0s), 25/25 VUs, 108 complete and 0 interrupted iterations
matinee   [  53% ] 25/25 VUs  0m35.3s/1m07.0s

running (0m37.0s), 25/25 VUs, 115 complete and 0 interrupted iterations
matinee   [  54% ] 25/25 VUs  0m36.3s/1m07.0s

running (0m38.0s), 25/25 VUs, 118 complete and 0 interrupted iterations
matinee   [  56% ] 25/25 VUs  0m37.3s/1m07.0s

running (0m39.0s), 25/25 VUs, 122 complete and 0 interrupted iterations
matinee   [  57% ] 25/25 VUs  0m38.3s/1m07.0s

running (0m40.0s), 25/25 VUs, 124 complete and 0 interrupted iterations
matinee   [  59% ] 25/25 VUs  0m39.3s/1m07.0s

running (0m41.0s), 25/25 VUs, 127 complete and 0 interrupted iterations
matinee   [  60% ] 25/25 VUs  0m40.3s/1m07.0s

running (0m42.0s), 25/25 VUs, 132 complete and 0 interrupted iterations
matinee   [  62% ] 25/25 VUs  0m41.3s/1m07.0s

running (0m43.0s), 25/25 VUs, 136 complete and 0 interrupted iterations
matinee   [  63% ] 25/25 VUs  0m42.3s/1m07.0s

running (0m44.0s), 25/25 VUs, 140 complete and 0 interrupted iterations
matinee   [  65% ] 25/25 VUs  0m43.3s/1m07.0s

running (0m45.0s), 25/25 VUs, 147 complete and 0 interrupted iterations
matinee   [  66% ] 25/25 VUs  0m44.3s/1m07.0s

running (0m46.0s), 25/25 VUs, 150 complete and 0 interrupted iterations
matinee   [  68% ] 25/25 VUs  0m45.3s/1m07.0s

running (0m47.0s), 25/25 VUs, 153 complete and 0 interrupted iterations
matinee   [  69% ] 25/25 VUs  0m46.3s/1m07.0s

running (0m48.0s), 25/25 VUs, 157 complete and 0 interrupted iterations
matinee   [  71% ] 25/25 VUs  0m47.3s/1m07.0s

running (0m49.0s), 25/25 VUs, 163 complete and 0 interrupted iterations
matinee   [  72% ] 25/25 VUs  0m48.3s/1m07.0s

running (0m50.0s), 25/25 VUs, 167 complete and 0 interrupted iterations
matinee   [  74% ] 25/25 VUs  0m49.3s/1m07.0s

running (0m51.0s), 25/25 VUs, 168 complete and 0 interrupted iterations
matinee   [  75% ] 25/25 VUs  0m50.3s/1m07.0s

running (0m52.0s), 25/25 VUs, 175 complete and 0 interrupted iterations
matinee   [  77% ] 25/25 VUs  0m51.3s/1m07.0s

running (0m53.0s), 25/25 VUs, 178 complete and 0 interrupted iterations
matinee   [  78% ] 25/25 VUs  0m52.3s/1m07.0s

running (0m54.0s), 25/25 VUs, 183 complete and 0 interrupted iterations
matinee   [  80% ] 25/25 VUs  0m53.3s/1m07.0s

running (0m55.0s), 25/25 VUs, 189 complete and 0 interrupted iterations
matinee   [  81% ] 25/25 VUs  0m54.3s/1m07.0s

running (0m56.0s), 25/25 VUs, 192 complete and 0 interrupted iterations
matinee   [  83% ] 25/25 VUs  0m55.3s/1m07.0s

running (0m57.0s), 25/25 VUs, 197 complete and 0 interrupted iterations
matinee   [  84% ] 25/25 VUs  0m56.3s/1m07.0s

running (0m58.0s), 25/25 VUs, 200 complete and 0 interrupted iterations
matinee   [  86% ] 25/25 VUs  0m57.3s/1m07.0s

running (0m59.0s), 24/25 VUs, 206 complete and 0 interrupted iterations
matinee   [  87% ] 24/25 VUs  0m58.3s/1m07.0s

running (1m00.0s), 23/25 VUs, 211 complete and 0 interrupted iterations
matinee   [  89% ] 23/25 VUs  0m59.3s/1m07.0s

running (1m01.0s), 22/25 VUs, 214 complete and 0 interrupted iterations
matinee   [  90% ] 22/25 VUs  1m00.3s/1m07.0s

running (1m02.0s), 20/25 VUs, 218 complete and 0 interrupted iterations
matinee   [  92% ] 20/25 VUs  1m01.3s/1m07.0s

running (1m03.0s), 18/25 VUs, 224 complete and 0 interrupted iterations
matinee   [  93% ] 18/25 VUs  1m02.3s/1m07.0s

running (1m04.0s), 17/25 VUs, 226 complete and 0 interrupted iterations
matinee   [  95% ] 17/25 VUs  1m03.3s/1m07.0s

running (1m05.0s), 11/25 VUs, 233 complete and 0 interrupted iterations
matinee   [  96% ] 11/25 VUs  1m04.3s/1m07.0s

running (1m06.0s), 10/25 VUs, 235 complete and 0 interrupted iterations
matinee   [  97% ] 10/25 VUs  1m05.3s/1m07.0s

running (1m07.0s), 10/25 VUs, 237 complete and 0 interrupted iterations
matinee   [  99% ] 10/25 VUs  1m06.3s/1m07.0s

running (1m08.0s), 06/25 VUs, 241 complete and 0 interrupted iterations
matinee ↓ [ 100% ] 06/25 VUs  1m7s

running (1m09.0s), 05/25 VUs, 242 complete and 0 interrupted iterations
matinee ↓ [ 100% ] 06/25 VUs  1m7s

running (1m10.0s), 05/25 VUs, 242 complete and 0 interrupted iterations
matinee ↓ [ 100% ] 06/25 VUs  1m7s

running (1m11.0s), 03/25 VUs, 244 complete and 0 interrupted iterations
matinee ↓ [ 100% ] 06/25 VUs  1m7s

running (1m12.0s), 01/25 VUs, 246 complete and 0 interrupted iterations
matinee ↓ [ 100% ] 06/25 VUs  1m7s

running (1m13.0s), 01/25 VUs, 246 complete and 0 interrupted iterations
matinee ↓ [ 100% ] 06/25 VUs  1m7s


  █ THRESHOLDS 

    checks
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration{name:login}
    ✓ 'p(95)<3000' p(95)=225.7ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%

    klassio_dossier_eleve
    ✓ 'p(95)<500' p(95)=34.73ms

    klassio_liste_eleves
    ✓ 'p(95)<1500' p(95)=154.95ms

    klassio_rapports
    ✓ 'p(95)<1200' p(95)=238.77ms

    klassio_tableau_de_bord
    ✓ 'p(95)<800' p(95)=132.67ms


  █ TOTAL RESULTS 

    checks_total.......: 3705    50.667368/s
    checks_succeeded...: 100.00% 3705 out of 3705
    checks_failed......: 0.00%   0 out of 3705

    ✓ tableau de bord : 200
    ✓ tableau de bord : champs attendus
    ✓ élèves : 200
    ✓ élèves : liste non vide
    ✓ élèves : champ « code » présent
    ✓ dossier : 200
    ✓ dossier : champs attendus
    ✓ rapports : 200
    ✓ rapports : champs attendus
    ✓ classes : 200
    ✓ classes : liste non vide
    ✓ classes : champ « name » présent
    ✓ enfants : 200
    ✓ enfants : liste non vide
    ✓ enfants : champ « code » présent

    CUSTOM
    klassio_dossier_eleve..........: med=12.66ms  p(90)=28.04ms  p(95)=34.73ms  p(99)=56.18ms  max=227.42ms
    klassio_liste_eleves...........: med=70.59ms  p(90)=132.34ms p(95)=154.95ms p(99)=227.8ms  max=374.94ms
    klassio_rapports...............: med=77.53ms  p(90)=178.59ms p(95)=238.77ms p(99)=461.02ms max=735.26ms
    klassio_tableau_de_bord........: med=54.39ms  p(90)=102.61ms p(95)=132.67ms p(99)=176.31ms max=325.49ms

    HTTP
    http_req_duration..............: med=26.25ms  p(90)=97.87ms  p(95)=135.69ms p(99)=242.89ms max=735.26ms
      { expected_response:true }...: med=26.25ms  p(90)=97.87ms  p(95)=135.69ms p(99)=242.89ms max=735.26ms
      { name:login }...............: med=219.64ms p(90)=225.02ms p(95)=225.7ms  p(99)=226.24ms max=226.37ms
    http_req_failed................: 0.00%  0 out of 1979
    http_reqs......................: 1979   27.063622/s

    EXECUTION
    iteration_duration.............: med=6.04s    p(90)=7.37s    p(95)=7.84s    p(99)=8.16s    max=8.24s   
    iterations.....................: 247    3.377825/s
    vus............................: 1      min=1         max=25
    vus_max........................: 25     min=25        max=25

    NETWORK
    data_received..................: 197 MB 2.7 MB/s
    data_sent......................: 318 kB 4.4 kB/s



running (1m13.1s), 00/25 VUs, 247 complete and 0 interrupted iterations
matinee ✓ [ 100% ] 00/25 VUs  1m7s